Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF6680.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF10EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF10EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD76">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF10EID8" edc:desc="" edc:mask="0x1" edc:name="RXF10EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10EID9" edc:desc="" edc:mask="0x1" edc:name="RXF10EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10EID10" edc:desc="" edc:mask="0x1" edc:name="RXF10EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10EID11" edc:desc="" edc:mask="0x1" edc:name="RXF10EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10EID12" edc:desc="" edc:mask="0x1" edc:name="RXF10EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10EID13" edc:desc="" edc:mask="0x1" edc:name="RXF10EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10EID14" edc:desc="" edc:mask="0x1" edc:name="RXF10EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10EID15" edc:desc="" edc:mask="0x1" edc:name="RXF10EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF10EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF10EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD77">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF10EID0" edc:desc="" edc:mask="0x1" edc:name="RXF10EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10EID1" edc:desc="" edc:mask="0x1" edc:name="RXF10EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10EID2" edc:desc="" edc:mask="0x1" edc:name="RXF10EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10EID3" edc:desc="" edc:mask="0x1" edc:name="RXF10EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10EID4" edc:desc="" edc:mask="0x1" edc:name="RXF10EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10EID5" edc:desc="" edc:mask="0x1" edc:name="RXF10EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10EID6" edc:desc="" edc:mask="0x1" edc:name="RXF10EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10EID7" edc:desc="" edc:mask="0x1" edc:name="RXF10EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF11SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF11SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD78">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF11SID3" edc:desc="" edc:mask="0x1" edc:name="RXF11SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11SID4" edc:desc="" edc:mask="0x1" edc:name="RXF11SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11SID5" edc:desc="" edc:mask="0x1" edc:name="RXF11SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11SID6" edc:desc="" edc:mask="0x1" edc:name="RXF11SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11SID7" edc:desc="" edc:mask="0x1" edc:name="RXF11SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11SID8" edc:desc="" edc:mask="0x1" edc:name="RXF11SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11SID9" edc:desc="" edc:mask="0x1" edc:name="RXF11SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF11SID10" edc:desc="" edc:mask="0x1" edc:name="RXF11SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
