Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF6680.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2D1" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE47">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B2D10" edc:desc="" edc:mask="0x1" edc:name="B2D10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D11" edc:desc="" edc:mask="0x1" edc:name="B2D11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D12" edc:desc="" edc:mask="0x1" edc:name="B2D12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D13" edc:desc="" edc:mask="0x1" edc:name="B2D13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D14" edc:desc="" edc:mask="0x1" edc:name="B2D14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D15" edc:desc="" edc:mask="0x1" edc:name="B2D15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D16" edc:desc="" edc:mask="0x1" edc:name="B2D16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D17" edc:desc="" edc:mask="0x1" edc:name="B2D17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2D2" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE48">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B2D20" edc:desc="" edc:mask="0x1" edc:name="B2D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D21" edc:desc="" edc:mask="0x1" edc:name="B2D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D22" edc:desc="" edc:mask="0x1" edc:name="B2D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D23" edc:desc="" edc:mask="0x1" edc:name="B2D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D24" edc:desc="" edc:mask="0x1" edc:name="B2D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D25" edc:desc="" edc:mask="0x1" edc:name="B2D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D26" edc:desc="" edc:mask="0x1" edc:name="B2D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D27" edc:desc="" edc:mask="0x1" edc:name="B2D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2D3" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE49">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B2D30" edc:desc="" edc:mask="0x1" edc:name="B2D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D31" edc:desc="" edc:mask="0x1" edc:name="B2D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D32" edc:desc="" edc:mask="0x1" edc:name="B2D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D33" edc:desc="" edc:mask="0x1" edc:name="B2D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D34" edc:desc="" edc:mask="0x1" edc:name="B2D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D35" edc:desc="" edc:mask="0x1" edc:name="B2D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D36" edc:desc="" edc:mask="0x1" edc:name="B2D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D37" edc:desc="" edc:mask="0x1" edc:name="B2D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2D4" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE4A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B2D40" edc:desc="" edc:mask="0x1" edc:name="B2D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D41" edc:desc="" edc:mask="0x1" edc:name="B2D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D42" edc:desc="" edc:mask="0x1" edc:name="B2D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D43" edc:desc="" edc:mask="0x1" edc:name="B2D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D44" edc:desc="" edc:mask="0x1" edc:name="B2D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D45" edc:desc="" edc:mask="0x1" edc:name="B2D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D46" edc:desc="" edc:mask="0x1" edc:name="B2D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D47" edc:desc="" edc:mask="0x1" edc:name="B2D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2D5" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE4B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B2D50" edc:desc="" edc:mask="0x1" edc:name="B2D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D51" edc:desc="" edc:mask="0x1" edc:name="B2D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D52" edc:desc="" edc:mask="0x1" edc:name="B2D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D53" edc:desc="" edc:mask="0x1" edc:name="B2D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D54" edc:desc="" edc:mask="0x1" edc:name="B2D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D55" edc:desc="" edc:mask="0x1" edc:name="B2D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D56" edc:desc="" edc:mask="0x1" edc:name="B2D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D57" edc:desc="" edc:mask="0x1" edc:name="B2D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2D6" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE4C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B2D60" edc:desc="" edc:mask="0x1" edc:name="B2D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D61" edc:desc="" edc:mask="0x1" edc:name="B2D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D62" edc:desc="" edc:mask="0x1" edc:name="B2D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D63" edc:desc="" edc:mask="0x1" edc:name="B2D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D64" edc:desc="" edc:mask="0x1" edc:name="B2D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D65" edc:desc="" edc:mask="0x1" edc:name="B2D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D66" edc:desc="" edc:mask="0x1" edc:name="B2D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D67" edc:desc="" edc:mask="0x1" edc:name="B2D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2D7" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE4D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B2D70" edc:desc="" edc:mask="0x1" edc:name="B2D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D71" edc:desc="" edc:mask="0x1" edc:name="B2D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D72" edc:desc="" edc:mask="0x1" edc:name="B2D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D73" edc:desc="" edc:mask="0x1" edc:name="B2D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D74" edc:desc="" edc:mask="0x1" edc:name="B2D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D75" edc:desc="" edc:mask="0x1" edc:name="B2D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D76" edc:desc="" edc:mask="0x1" edc:name="B2D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2D77" edc:desc="" edc:mask="0x1" edc:name="B2D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CANSTAT_RO7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANSTAT_RO7" edc:nzwidth="0x8" edc:por="10000000" edc:_addr="0xE4E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1/ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2/ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3/ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnsnnnr" edc:cname="CANCON_RO7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANCON_RO7" edc:nzwidth="0x8" edc:por="10000000" edc:_addr="0xE4F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0/FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1/FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2/FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP0" edc:desc="" edc:mask="0x1" edc:name="REQOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP1" edc:desc="" edc:mask="0x1" edc:name="REQOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP2" edc:desc="" edc:mask="0x1" edc:name="REQOP2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrrnnnn" edc:cname="B3CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="B3CON" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xE50">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT0_TXPRI0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0_TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1_TXPRI1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1_TXPRI1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2_RTREN" edc:desc="" edc:mask="0x1" edc:name="FILHIT2_RTREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3_TXREQ" edc:desc="" edc:mask="0x1" edc:name="FILHIT3_TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4_TXERR" edc:desc="" edc:mask="0x1" edc:name="FILHIT4_TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTRRO_TXLARB" edc:desc="" edc:mask="0x1" edc:name="RTRRO_TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1_TXABT" edc:desc="" edc:mask="0x1" edc:name="RXM1_TXABT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL_TXBIF" edc:desc="" edc:mask="0x1" edc:name="RXFUL_TXBIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2" edc:desc="" edc:mask="0x1" edc:name="FILHIT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3" edc:desc="" edc:mask="0x1" edc:name="FILHIT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4" edc:desc="" edc:mask="0x1" edc:name="FILHIT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTRRO" edc:desc="" edc:mask="0x1" edc:name="RTRRO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1" edc:desc="" edc:mask="0x1" edc:name="RXM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TXPRI0" edc:desc="" edc:mask="0x1" edc:name="TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXPRI1" edc:desc="" edc:mask="0x1" edc:name="TXPRI1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTREN" edc:desc="" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXABT" edc:desc="" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBIF" edc:desc="" edc:mask="0x1" edc:name="TXBIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B3FILHIT0" edc:desc="" edc:mask="0x1" edc:name="B3FILHIT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3FILHIT1" edc:desc="" edc:mask="0x1" edc:name="B3FILHIT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3FILHIT2" edc:desc="" edc:mask="0x1" edc:name="B3FILHIT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3FILHIT3" edc:desc="" edc:mask="0x1" edc:name="B3FILHIT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3FILHIT4" edc:desc="" edc:mask="0x1" edc:name="B3FILHIT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3RTRRO" edc:desc="" edc:mask="0x1" edc:name="B3RTRRO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3RXM1" edc:desc="" edc:mask="0x1" edc:name="B3RXM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3RXFUL" edc:desc="" edc:mask="0x1" edc:name="B3RXFUL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:SFRFieldDef edc:cname="B3TXPRI0" edc:desc="" edc:mask="0x1" edc:name="B3TXPRI0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3TXPRI1" edc:desc="" edc:mask="0x1" edc:name="B3TXPRI1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3RTREN" edc:desc="" edc:mask="0x1" edc:name="B3RTREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3TXREQ" edc:desc="" edc:mask="0x1" edc:name="B3TXREQ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3TXERR" edc:desc="" edc:mask="0x1" edc:name="B3TXERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3TXLARB" edc:desc="" edc:mask="0x1" edc:name="B3TXLARB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3TXABT" edc:desc="" edc:mask="0x1" edc:name="B3TXABT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3TXB3IF" edc:desc="" edc:mask="0x1" edc:name="B3TXB3IF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE51">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B3SID3" edc:desc="" edc:mask="0x1" edc:name="B3SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3SID4" edc:desc="" edc:mask="0x1" edc:name="B3SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3SID5" edc:desc="" edc:mask="0x1" edc:name="B3SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3SID6" edc:desc="" edc:mask="0x1" edc:name="B3SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3SID7" edc:desc="" edc:mask="0x1" edc:name="B3SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3SID8" edc:desc="" edc:mask="0x1" edc:name="B3SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3SID9" edc:desc="" edc:mask="0x1" edc:name="B3SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3SID10" edc:desc="" edc:mask="0x1" edc:name="B3SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="B3SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu" edc:name="B3SIDL" edc:nzwidth="0x8" edc:por="xxxxx-xx" edc:_addr="0xE52">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B3EID16" edc:desc="" edc:mask="0x1" edc:name="B3EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID17" edc:desc="" edc:mask="0x1" edc:name="B3EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="B3EXID" edc:desc="" edc:mask="0x1" edc:name="B3EXID" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3SRR" edc:desc="" edc:mask="0x1" edc:name="B3SRR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3SID0" edc:desc="" edc:mask="0x1" edc:name="B3SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3SID1" edc:desc="" edc:mask="0x1" edc:name="B3SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3SID2" edc:desc="" edc:mask="0x1" edc:name="B3SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="B3EXIDE" edc:desc="" edc:mask="0x1" edc:name="B3EXIDE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
