Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF6680.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B5D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B5D2" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE78">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B5D20" edc:desc="" edc:mask="0x1" edc:name="B5D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D21" edc:desc="" edc:mask="0x1" edc:name="B5D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D22" edc:desc="" edc:mask="0x1" edc:name="B5D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D23" edc:desc="" edc:mask="0x1" edc:name="B5D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D24" edc:desc="" edc:mask="0x1" edc:name="B5D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D25" edc:desc="" edc:mask="0x1" edc:name="B5D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D26" edc:desc="" edc:mask="0x1" edc:name="B5D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D27" edc:desc="" edc:mask="0x1" edc:name="B5D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="B57D23" edc:desc="" edc:mask="0x1" edc:name="B57D23" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B5D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B5D3" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE79">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B5D30" edc:desc="" edc:mask="0x1" edc:name="B5D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D31" edc:desc="" edc:mask="0x1" edc:name="B5D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D32" edc:desc="" edc:mask="0x1" edc:name="B5D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D33" edc:desc="" edc:mask="0x1" edc:name="B5D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D34" edc:desc="" edc:mask="0x1" edc:name="B5D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D35" edc:desc="" edc:mask="0x1" edc:name="B5D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D36" edc:desc="" edc:mask="0x1" edc:name="B5D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D37" edc:desc="" edc:mask="0x1" edc:name="B5D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B5D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B5D4" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE7A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B5D40" edc:desc="" edc:mask="0x1" edc:name="B5D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D41" edc:desc="" edc:mask="0x1" edc:name="B5D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D42" edc:desc="" edc:mask="0x1" edc:name="B5D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D43" edc:desc="" edc:mask="0x1" edc:name="B5D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D44" edc:desc="" edc:mask="0x1" edc:name="B5D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D45" edc:desc="" edc:mask="0x1" edc:name="B5D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D46" edc:desc="" edc:mask="0x1" edc:name="B5D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D47" edc:desc="" edc:mask="0x1" edc:name="B5D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B5D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B5D5" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE7B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B5D50" edc:desc="" edc:mask="0x1" edc:name="B5D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D51" edc:desc="" edc:mask="0x1" edc:name="B5D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D52" edc:desc="" edc:mask="0x1" edc:name="B5D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D53" edc:desc="" edc:mask="0x1" edc:name="B5D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D54" edc:desc="" edc:mask="0x1" edc:name="B5D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D55" edc:desc="" edc:mask="0x1" edc:name="B5D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D56" edc:desc="" edc:mask="0x1" edc:name="B5D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D57" edc:desc="" edc:mask="0x1" edc:name="B5D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B5D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B5D6" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE7C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B5D60" edc:desc="" edc:mask="0x1" edc:name="B5D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D61" edc:desc="" edc:mask="0x1" edc:name="B5D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D62" edc:desc="" edc:mask="0x1" edc:name="B5D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D63" edc:desc="" edc:mask="0x1" edc:name="B5D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D64" edc:desc="" edc:mask="0x1" edc:name="B5D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D65" edc:desc="" edc:mask="0x1" edc:name="B5D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D66" edc:desc="" edc:mask="0x1" edc:name="B5D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D67" edc:desc="" edc:mask="0x1" edc:name="B5D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B5D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B5D7" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE7D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B5D70" edc:desc="" edc:mask="0x1" edc:name="B5D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D71" edc:desc="" edc:mask="0x1" edc:name="B5D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D72" edc:desc="" edc:mask="0x1" edc:name="B5D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D73" edc:desc="" edc:mask="0x1" edc:name="B5D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D74" edc:desc="" edc:mask="0x1" edc:name="B5D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D75" edc:desc="" edc:mask="0x1" edc:name="B5D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D76" edc:desc="" edc:mask="0x1" edc:name="B5D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5D77" edc:desc="" edc:mask="0x1" edc:name="B5D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
