Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF6680.PIC
        <edc:SFRDef edc:access="-n--nnnn" edc:cname="TXB0DLC" edc:desc="" edc:impl="0x4f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0u00uuuu" edc:name="TXB0DLC" edc:nzwidth="0x8" edc:por="0x00xxxx" edc:_addr="0xF45">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TXRTR" edc:desc="" edc:mask="0x1" edc:name="TXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB0DLC0" edc:desc="" edc:mask="0x1" edc:name="TXB0DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0DLC1" edc:desc="" edc:mask="0x1" edc:name="TXB0DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0DLC2" edc:desc="" edc:mask="0x1" edc:name="TXB0DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0DLC3" edc:desc="" edc:mask="0x1" edc:name="TXB0DLC3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TXB0RTR" edc:desc="" edc:mask="0x1" edc:name="TXB0RTR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D0" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF46">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D00" edc:desc="" edc:mask="0x1" edc:name="TXB0D00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D01" edc:desc="" edc:mask="0x1" edc:name="TXB0D01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D02" edc:desc="" edc:mask="0x1" edc:name="TXB0D02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D03" edc:desc="" edc:mask="0x1" edc:name="TXB0D03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D04" edc:desc="" edc:mask="0x1" edc:name="TXB0D04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D05" edc:desc="" edc:mask="0x1" edc:name="TXB0D05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D06" edc:desc="" edc:mask="0x1" edc:name="TXB0D06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D07" edc:desc="" edc:mask="0x1" edc:name="TXB0D07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D1" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF47">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D10" edc:desc="" edc:mask="0x1" edc:name="TXB0D10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D11" edc:desc="" edc:mask="0x1" edc:name="TXB0D11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D12" edc:desc="" edc:mask="0x1" edc:name="TXB0D12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D13" edc:desc="" edc:mask="0x1" edc:name="TXB0D13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D14" edc:desc="" edc:mask="0x1" edc:name="TXB0D14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D15" edc:desc="" edc:mask="0x1" edc:name="TXB0D15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D16" edc:desc="" edc:mask="0x1" edc:name="TXB0D16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D17" edc:desc="" edc:mask="0x1" edc:name="TXB0D17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D2" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF48">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D20" edc:desc="" edc:mask="0x1" edc:name="TXB0D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D21" edc:desc="" edc:mask="0x1" edc:name="TXB0D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D22" edc:desc="" edc:mask="0x1" edc:name="TXB0D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D23" edc:desc="" edc:mask="0x1" edc:name="TXB0D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D24" edc:desc="" edc:mask="0x1" edc:name="TXB0D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D25" edc:desc="" edc:mask="0x1" edc:name="TXB0D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D26" edc:desc="" edc:mask="0x1" edc:name="TXB0D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D27" edc:desc="" edc:mask="0x1" edc:name="TXB0D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
